<template>
	<div>
		<div class="m-desc-wrapper" v-for="(item, index) in wordsList" :key="index">
			<div class="m-words">
				{{item}}
			</div>
			<el-divider></el-divider>
		</div>
	</div>

</template>

<script>
	export default {
		name: 'DescItem',
		data() {
			return {
				wordsList: [
					'人总会有迷茫的时候，这时候我们就需要心灵鸡汤啦，宁愿跑起来被拌倒无数次，也不愿规规矩矩走一辈子。就算跌倒也要豪迈的笑。，不要生气要争气，不要看破要突破，不要嫉妒要欣赏，不要托延要积极，不要心动要行动。，只有经历过地狱般的折磨，才有征服天堂的力量，只有流过血的手指，才能弹出世间的绝唱。，这个社会是存在不公平的，不要抱怨，因为没有用!人总是在反省中进步的!，不要轻易用过去来衡量生活的幸与不幸!每个人的生命都是可以绽放美丽，只要你珍惜。，生活不是等待风暴过去，而是学会在雨中翩翩起舞。'
					,'不要去考虑自己能够走多快，只要知道自己在不断努力向前就行，路对了，成功就不远了。放弃了，就不该后悔。失去了，就不该回忆。放下该放下，退出那没结局的剧。我们需要一点点的眼泪去洗掉眼中的迷雾，一点点的拥抱去疗愈受伤的心，一点点的休息去继续前行。我们的烦忧，莫过放不下曾经的美好，执着于一个走远的人，一段枯萎的情，一件尘封的事。每个人的人生都是不一样的，处同样的位置，也是有人哭，有人笑，有人沉默。十二、走过了所有的路，才知道幸福是用来感受的，伤痛是用来成长的。'
					,'生命中最好的事情就是那些值得的等待，值得为之奋斗，也值得永不放弃。谎言就是谎言，不会因为它是漂亮的，就不会伤害到别人。转瞬即逝的，不仅仅是爱情，勇敢的去争取所有你想要的，不要让明天的自己后悔今天的作为。我走遍你所经历的每一个角落，不是为了遇见，只是为了感受你的曾经。志在山顶的人，不会贪念山腰的风景。把艰辛的劳作看作是生命的必然，即使没有收获的希望也心平气和的继续。穷则思变，差则思勤!没有比人更高的山没有比脚更长的路。'
				]
			}
		}
	}
</script>

<style lang="scss">
	.m-desc-wrapper {
		height: 100px;
		padding-left: 40px;
		padding-right: 40px;
		margin-top: 40px;

		.m-words {
			font-size: 16px;
			color: #909399;
		}
	}
</style>
